{
  "id": "ALAS2023-2026-1413",
  "title": "Amazon Linux 2023 - ALAS2023-2026-1413: Important priority package update for python3.13-pip",
  "issued": {
    "date": "2026-02-03 01:26:00"
  },
  "updated": {
    "date": "2026-02-03 01:26:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2026-21441:\n\turllib3 is an HTTP client library for Python. urllib3's streaming API is designed for the efficient handling of large HTTP responses by reading the content in chunks, rather than loading the entire response body into memory at once. urllib3 can perform decoding or decompression based on the HTTP `Content-Encoding` header (e.g., `gzip`, `deflate`, `br`, or `zstd`). When using the streaming API, the library decompresses only the necessary bytes, enabling partial content consumption. Starting in version 1.22 and prior to version 2.6.3, for HTTP redirect responses, the library would read the entire response body to drain the connection and decompress the content unnecessarily. This decompression occurred even before any read methods were called, and configured read limits did not restrict the amount of decompressed data. As a result, there was no safeguard against decompression bombs. A malicious server could exploit this to trigger excessive resource consumption on the client. Applications and libraries are affected when they stream content from untrusted sources by setting `preload_content=False` when they do not disable redirects. Users should upgrade to at least urllib3 v2.6.3, in which the library does not decode content of redirect responses when `preload_content=False`. If upgrading is not immediately possible, disable redirects by setting `redirect=False` for requests to untrusted source.\n",
  "packages": [
    {
      "name": "python3.13-pip-wheel",
      "epoch": "0",
      "version": "24.2",
      "release": "259.amzn2023.0.3",
      "arch": "noarch",
      "filename": "Packages/python3.13-pip-wheel-24.2-259.amzn2023.0.3.noarch.rpm"
    },
    {
      "name": "python3.13-pip",
      "epoch": "0",
      "version": "24.2",
      "release": "259.amzn2023.0.3",
      "arch": "noarch",
      "filename": "Packages/python3.13-pip-24.2-259.amzn2023.0.3.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2026-21441",
      "id": "CVE-2026-21441",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2026-21441"
  ]
}